# PenColorByClass

## Description
Sets the default document pen colors to the pen colors of the active class.

```pascal
PROCEDURE PenColorByClass;
```

```python
def vs.PenColorByClass():
    return None
```

## Remarks
Sets the global attributes to use the pen color of the default class.
[sd 8/19/98]

## See Also
VS Functions:
FillColorByClass

## Version
Availability: from VectorWorks8.0

## Category
* Classes